Repository: Kbunet/kbuc-certifier
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: W3 Certificate Manager
ar: مدير شهادات W3

# searchHint
source: Search certificates...
ar: البحث في الشهادات...

source: Filter by Tags
ar: تصفية حسب العلامات

source: Filter Content
ar: تصفية المحتوى

source: Help
ar: مساعدة

source: Settings
ar: الإعدادات

# createContent
source: Create Certificate
ar: إنشاء شهادة

# importContent
source: Import Certificate
ar: استيراد شهادة

source: Batch Import
ar: استيراد مجموعة

source: Refresh
ar: تحديث

source: No certificates found
ar: لم يتم العثور على شهادات

# tryRemovingFilters
source: Try removing some tag filters
ar: حاول إزالة بعض عوامل تصفية العلامات

source: Clear all filters
ar: مسح جميع عوامل التصفية

source: Selected
ar: محدد

source: Select all
ar: تحديد الكل

source: Export to CSV
ar: تصدير إلى CSV

source: Update tags
ar: تحديث العلامات

source: Delete selected
ar: حذف المحدد

source: Active filters:
ar: عوامل التصفية النشطة:

source: AND
ar: و

source: OR
ar: أو

source: DELETE
ar: حذف

source: CANCEL
ar: إلغاء

source: Close
ar: إغلاق

source: Apply
ar: تطبيق

source: Save
ar: حفظ

source: QR Code
ar: رمز QR

source: Profile
ar: الملف الشخصي

# helpAndInformation
source: Help & Information
ar: المساعدة والمعلومات

# aboutApp
source: About W3 Certificate Manager
ar: حول مدير شهادات W3

# aboutAppContent
source: W3 Certificate Manager is an application designed to create, manage, and verify academic certificates using the W3CertificateStandard based on CertHash v1.1 specification.
ar: مدير شهادات W3 هو تطبيق مصمم لإنشاء وإدارة والتحقق من الشهادات الأكاديمية باستخدام معيار W3CertificateStandard المستند إلى مواصفات CertHash v1.1.

source: Certificate Types
ar: أنواع الشهادات

# certificateTypesContent
source: The application supports various certificate types including: degree, attendance, appreciation, participation, completion, and honor certificates.
ar: يدعم التطبيق أنواعًا مختلفة من الشهادات بما في ذلك: شهادات الدرجة العلمية، والحضور، والتقدير، والمشاركة، والإتمام، والشرف.

source: Creating Certificates
ar: إنشاء الشهادات

source: Single Certificate
ar: شهادة واحدة

# singleCertificateContent
source: Tap the + button in the bottom right corner to create a new certificate. Fill in all required fields (marked with *) and any optional fields.
ar: انقر على زر + في الزاوية السفلية اليمنى لإنشاء شهادة جديدة. املأ جميع الحقول المطلوبة (المميزة بـ *) وأي حقول اختيارية.

# batchImportTitle
source: Batch Import
ar: استيراد مجموعة

# batchImportContent
source: Tap the chart icon to import multiple certificates at once using a CSV file. The CSV must include all required fields (type, recipient, issuer, description, date).
ar: انقر على أيقونة المخطط لاستيراد شهادات متعددة دفعة واحدة باستخدام ملف CSV. يجب أن يتضمن ملف CSV جميع الحقول المطلوبة (النوع، المستلم، المصدر، الوصف، التاريخ).

source: Required Fields
ar: الحقول المطلوبة

# requiredFieldsContent
source: • Type: The certificate type (degree, attendance, etc.) • Recipient: Person receiving the certificate • Issuer: Organization issuing the certificate • Description: Brief description of achievement • Date: Issue date in YYYY-MM-DD format
ar: • النوع: نوع الشهادة (درجة علمية، حضور، إلخ) • المستلم: الشخص الذي يتلقى الشهادة • المصدر: المؤسسة التي تصدر الشهادة • الوصف: وصف موجز للإنجاز • التاريخ: تاريخ الإصدار بتنسيق YYYY-MM-DD

source: Optional Fields
ar: الحقول الاختيارية

# optionalFieldsContent
source: • Duration: Length of course/program • Event: Associated event name • Location: Where certificate was issued • Certificate ID: Unique identifier • Tags: Keywords for filtering (comma-separated)
ar: • المدة: مدة الدورة/البرنامج • الحدث: اسم الحدث المرتبط • الموقع: مكان إصدار الشهادة • معرف الشهادة: معرف فريد • العلامات: كلمات رئيسية للتصفية (مفصولة بفواصل)

source: Managing Certificates
ar: إدارة الشهادات

source: Searching
ar: البحث

# searchingContent
source: Use the search bar at the top of the main screen to find certificates by recipient name, description, or other fields.
ar: استخدم شريط البحث في أعلى الشاشة الرئيسية للعثور على الشهادات حسب اسم المستلم أو الوصف أو الحقول الأخرى.

source: Filtering by Tags
ar: التصفية حسب العلامات

# filteringByTagsContent
source: Click the tag icon in the top right to filter certificates by tags. You can choose between AND/OR logic for multiple tags.
ar: انقر على أيقونة العلامة في الجزء العلوي الأيمن لتصفية الشهادات حسب العلامات. يمكنك الاختيار بين منطق AND/OR للعلامات المتعددة.

source: Certificate Details
ar: تفاصيل الشهادة

# certificateDetailsContent
source: Click on any certificate in the list to view its full details, including all fields and verification status.
ar: انقر على أي شهادة في القائمة لعرض تفاصيلها الكاملة، بما في ذلك جميع الحقول وحالة التحقق.

# qrCodeContent
source: Use the QR code button on a certificate to generate a QR code containing the certificate hash for easy verification.
ar: استخدم زر رمز QR على الشهادة لإنشاء رمز QR يحتوي على تجزئة الشهادة للتحقق بسهولة.

source: Deleting
ar: الحذف

# deletingContent
source: Swipe left on a certificate or use the delete button to remove it from your collection.
ar: اسحب لليسار على شهادة أو استخدم زر الحذف لإزالتها من مجموعتك.

source: Batch Operations
ar: عمليات المجموعة

source: Multi-Select Mode
ar: وضع التحديد المتعدد

# multiSelectModeContent
source: Long press on any certificate to enter multi-select mode. Then tap on other certificates to select multiple items.
ar: اضغط مطولاً على أي شهادة للدخول في وضع التحديد المتعدد. ثم انقر على شهادات أخرى لتحديد عناصر متعددة.

source: Batch Tag Updates
ar: تحديثات العلامات المجمعة

# batchTagUpdatesContent
source: In multi-select mode, tap the tag icon to update tags for all selected certificates at once.
ar: في وضع التحديد المتعدد، انقر على أيقونة العلامة لتحديث العلامات لجميع الشهادات المحددة دفعة واحدة.

source: CSV Export
ar: تصدير CSV

# csvExportContent
source: In multi-select mode, tap the download icon to export all selected certificates to a CSV file that can be used for re-import.
ar: في وضع التحديد المتعدد، انقر على أيقونة التنزيل لتصدير جميع الشهادات المحددة إلى ملف CSV يمكن استخدامه لإعادة الاستيراد.

source: Batch Delete
ar: حذف المجموعة

# batchDeleteContent
source: In multi-select mode, tap the delete icon to remove all selected certificates at once.
ar: في وضع التحديد المتعدد، انقر على أيقونة الحذف لإزالة جميع الشهادات المحددة دفعة واحدة.

source: Verification & Blockchain
ar: التحقق وسلسلة الكتل

source: Certificate Hash
ar: هاش الشهادة

# certificateHashContent
source: Each certificate has a unique and deterministic hash created based on its content. This hash ensures the certificate cannot be tampered with.
ar: تحتوي كل شهادة على تجزئة فريدة وحتمية تم إنشاؤها بناءً على محتواها. تضمن هذه التجزئة عدم إمكانية العبث بالشهادة.

source: ElectrumX Connection
ar: اتصال ElectrumX

# electrumXConnectionContent
source: Configure your ElectrumX server connection in the settings screen to verify certificates against blockchain records.
ar: قم بتكوين اتصال خادم ElectrumX الخاص بك في شاشة الإعدادات للتحقق من الشهادات مقابل سجلات البلوكشين.

source: Verification Status
ar: حالة التحقق

# verificationStatusContent
source: Certificates registered on the blockchain will show a verification badge with the number of confirmations.
ar: ستظهر الشهادات المسجلة على البلوكشين شارة تحقق مع عدد التأكيدات.

source: ElectrumX Server
ar: خادم ElectrumX

# electrumXServerContent
source: Configure the ElectrumX server connection details including host, port, and protocol.
ar: قم بتكوين تفاصيل اتصال خادم ElectrumX بما في ذلك المضيف والمنفذ والبروتوكول.

source: Theme Settings
ar: إعدادات السمة

# themeSettingsContent
source: Change between light and dark themes or use system default.
ar: التبديل بين السمات الفاتحة والداكنة أو استخدام الإعداد الافتراضي للنظام.

source: Language Settings
ar: إعدادات اللغة

# languageSettingsContent
source: Choose your preferred language for the application interface.
ar: اختر لغتك المفضلة لواجهة التطبيق.

source: Storage Information
ar: معلومات التخزين

# storageInformationContent
source: Certificate data is stored locally on your device in the application's documents directory. The app can efficiently handle thousands of certificates, but performance may decrease with very large collections.
ar: يتم تخزين بيانات الشهادة محليًا على جهازك في دليل مستندات التطبيق. يمكن للتطبيق التعامل بكفاءة مع آلاف الشهادات، ولكن قد ينخفض الأداء مع المجموعات الكبيرة جدًا.

source: Export Directories
ar: مسارات التصدير

source: Export Location
ar: موقع التصدير

# exportLocationContent
source: All exported files (certificates and CSV exports) are saved to a dedicated "KbucCertifier" folder for easy access.
ar: يتم حفظ جميع الملفات المصدرة (الشهادات وملفات CSV) في مجلد مخصص باسم "KbucCertifier" لسهولة الوصول إليها.

# windowsPath
source: Windows
ar: ويندوز

# macOSPath
source: macOS
ar: ماك أو إس

# linuxPath
source: Linux
ar: لينكس

# androidPath
source: Android
ar: أندرويد

# androidPathContent
source: In the Downloads/KbucCertifier folder in your device storage.
ar: في مجلد Downloads/KbucCertifier في تخزين جهازك.

# iOSPath
source: iOS
ar: آي أو إس

# iOSPathContent
source: In the app's documents directory under KbucCertifier folder.
ar: في دليل مستندات التطبيق ضمن مجلد KbucCertifier.

# verifying
source: Verifying Certificate
ar: التحقق من الشهادة

# fetchingProfile
source: Fetching certificate profile...
ar: جاري جلب الملف الشخصي للشهادة...

source: Certificate Profile
ar: الملف الشخصي للشهادة

# noProfileFound
source: No profile information found
ar: لم يتم العثور على معلومات الملف الشخصي

source: Error fetching profile
ar: خطأ في جلب الملف الشخصي

source: Showing
ar: عرض

# ofTotal
source: of
ar: من

source: per page
ar: في الصفحة

source: First page
ar: الصفحة الأولى

source: Previous page
ar: الصفحة السابقة

source: Next page
ar: الصفحة التالية

source: Last page
ar: الصفحة الأخيرة

# appVersion
source: W3 Certificate Manager v1.0
ar: مدير شهادات W3 الإصدار 1.0

source: Batch Certificate Upload
ar: تحميل الشهادات بالدفعة

source: Upload Multiple Certificates
ar: تحميل شهادات متعددة

# batchUploadDescription
source: Use this tool to upload multiple certificates at once using a CSV file. Each row in the CSV will be converted to a separate certificate.
ar: استخدم هذه الأداة لتحميل شهادات متعددة دفعة واحدة باستخدام ملف CSV. سيتم تحويل كل صف في ملف CSV إلى شهادة منفصلة.

source: Step 1: Download Template
ar: الخطوة 1: تنزيل القالب

# downloadTemplateDescription
source: Download a CSV template with all required and optional fields for certificates.
ar: تنزيل قالب CSV يحتوي على جميع الحقول المطلوبة والاختيارية للشهادات.

source: Download Template
ar: تنزيل القالب

# step2UploadCSV
source: Step 2: Upload CSV File
ar: الخطوة 2: تحميل ملف CSV

# uploadCSVDescription
source: Fill in the template with your certificate data and upload it here.
ar: املأ القالب ببيانات الشهادات الخاصة بك وقم بتحميله هنا.

source: Select CSV File
ar: اختيار ملف CSV

# selectedFile
source: Selected file: {filename}
ar: الملف المحدد: {filename}

source: Step 3: Review & Process
ar: الخطوة 3: المراجعة والمعالجة

# foundCertificates
source: Found {count} certificate(s) to process.
ar: تم العثور على {count} شهادة (شهادات) للمعالجة.

# addTagsToAll
source: Add tags to all certificates:
ar: إضافة علامات لجميع الشهادات:

# enterCommonTags
source: Enter common tags for all certificates
ar: أدخل العلامات المشتركة لجميع الشهادات

# processing
source: Processing: {current} of {total}
ar: جاري المعالجة: {current} من {total}

source: Create Certificates
ar: إنشاء الشهادات

# error
source: Error: {message}
ar: خطأ: {message}

# templateDownloaded
source: Template downloaded to: {path} You can open it with any spreadsheet application.
ar: تم تنزيل القالب إلى: {path} يمكنك فتحه بأي تطبيق جدول بيانات.

# failedToCreateTemplate
source: Failed to create template: {error}
ar: فشل في إنشاء القالب: {error}

# failedToProcessCSV
source: Failed to process CSV file: {error}
ar: فشل في معالجة ملف CSV: {error}

source: No certificates to process
ar: لا توجد شهادات للمعالجة

# failedToCreateCertificates
source: Failed to create certificates: {error}
ar: فشل في إنشاء الشهادات: {error}

# certificatesCreatedSuccess
source: Successfully created {count} certificate(s)
ar: تم إنشاء {count} شهادة (شهادات) بنجاح

# certificatesCreatedWithSkipped
source: Successfully created {created} certificate(s), skipped {skipped} duplicate(s)
ar: تم إنشاء {created} شهادة (شهادات) بنجاح، تم تخطي {skipped} مكررة

# noValidCertificateData
source: No valid certificate data found in the CSV file
ar: لم يتم العثور على بيانات شهادة صالحة في ملف CSV

source: Content Information
ar: معلومات المحتوى

source: ID
ar: المعرف

source: Standard Name
ar: اسم المعيار

source: Standard Version
ar: إصدار المعيار

source: Files
ar: الملفات

source: Content Hash
ar: تجزئة المحتوى

source: Name
ar: الاسم

source: Description
ar: الوصف

source: Created
ar: تاريخ الإنشاء

source: Creator
ar: المنشئ

# owner
source: Owner: {owner}
ar: المالك: {owner}

source: Not Set
ar: غير محدد

source: Reputation Score
ar: نقاط السمعة

source: Tags
ar: العلامات

source: No tags
ar: لا توجد علامات

source: Edit tags
ar: تعديل العلامات

source: Actions
ar: الإجراءات

source: Verify Content
ar: التحقق من المحتوى

source: Verifying content...
ar: جاري التحقق من المحتوى...

# contentVerificationSuccess
source: Content verification successful! All files are valid.
ar: تم التحقق من المحتوى بنجاح! جميع الملفات صالحة.

# contentVerificationFailed
source: Content verification failed. Files may be corrupted or missing.
ar: فشل التحقق من المحتوى. قد تكون الملفات تالفة أو مفقودة.

# verificationError
source: Verification error: {error}
ar: خطأ في التحقق: {error}

source: Export Content
ar: تصدير المحتوى

# contentExportedSuccess
source: Content exported successfully
ar: تم تصدير المحتوى بنجاح

# failedToExportContent
source: Failed to export content: {error}
ar: فشل تصدير المحتوى: {error}

source: Delete Content
ar: حذف المحتوى

# deleteContentConfirmation
source: Are you sure you want to delete this certificate? This action cannot be undone.
ar: هل أنت متأكد من رغبتك في حذف هذا المحتوى؟ لا يمكن التراجع عن هذا الإجراء.

source: Type
ar: النوع

source: Recipient
ar: المستلم

source: Issuer
ar: المصدر

source: Date
ar: التاريخ

# duration
source: Duration: {duration} seconds
ar: المدة: {duration} ثانية

source: Event
ar: الحدث

source: Location
ar: الموقع

source: Certificate ID
ar: معرف الشهادة

source: Show Certificate QR Code
ar: عرض رمز QR للشهادة

source: Send Reputation
ar: إرسال سمعة

source: Share
ar: مشاركة

source: Show QR Code
ar: عرض رمز QR

source: Edit Certificate Tags
ar: تعديل علامات الشهادة

source: Certificate Tags
ar: علامات الشهادة

source: Enter tags separated by commas
ar: أدخل العلامات مفصولة بفواصل

source: Tags updated successfully
ar: تم تحديث العلامات بنجاح

# failedToUpdateTags
source: Failed to update tags: {error}
ar: فشل تحديث العلامات: {error}

source: Certificate hash verified
ar: تم التحقق من تجزئة الشهادة

# addressQRTitle
source: Address: {label}
ar: عنوان {label}

source: Support Address
ar: دعم العنوان

source: Verify Address
ar: التحقق من العنوان

source: Address Hash
ar: تجزئة العنوان

source: Support
ar: دعم

source: Copy
ar: نسخ

source: Address copied to clipboard
ar: تم نسخ العنوان إلى الحافظة

source: Copied to clipboard
ar: تم النسخ إلى الحافظة

source: Copy to clipboard
ar: نسخ إلى الحافظة

source: Register Certificate
ar: تسجيل الشهادة

source: Verify Certificate
ar: التحقق من الشهادة

source: Hash
ar: هاش

source: Register
ar: تسجيل

source: Verify
ar: تحقق

source: Standard:
ar: المعيار:

source: All Standards
ar: جميع المعايير

source: Show Registered Only
ar: إظهار المسجلة فقط

source: Clear Filters
ar: مسح التصفية

# selectTagsToFilter
source: Select tags to filter certificates:
ar: اختر العلامات لتصفية الشهادات:

source: Clear All
ar: مسح الكل

source: Profile Information
ar: معلومات الملف الشخصي

source: Fetching profile data...
ar: جاري جلب بيانات الملف الشخصي...

source: No profile data found
ar: لم يتم العثور على بيانات الملف الشخصي

# ownerLabel
source: Owner
ar: المالك

# tenant
source: Tenant: {tenant}
ar: المستأجر: {tenant}

# rentedAt
source: Rented At: {date}
ar: تاريخ الإيجار: {date}

# durationLabel
source: Duration
ar: المدة

# ownedProfiles
source: Owned Profiles: {count}
ar: الملفات الشخصية المملوكة: {count}

source: Retry
ar: إعادة المحاولة

# errorTitle
source: Error
ar: خطأ

source: Official Website
ar: الموقع الرسمي

source: Export
ar: تصدير

source: View
ar: عرض

# searchCertificates
source: Search certificates or tags...
ar: البحث في الشهادات أو العلامات...

source: Filter Logic:
ar: منطق التصفية:

# unifiedSearch
source: Unified
ar: موحد

source: Active Tags:
ar: العلامات النشطة:

source: Blockchain Integration
ar: تكامل البلوكشين

source: Privacy-Preserving Verification
ar: التحقق مع الحفاظ على الخصوصية

# privacyPreservingVerificationContent
source: Only a cryptographic hash of the certificate data is recorded on-chain. The actual content remains off-chain, preserving privacy while allowing public verification.
ar: يتم تسجيل التجزئة التشفيرية فقط لبيانات الشهادة على البلوكشين. يظل المحتوى الفعلي خارج البلوكشين، مما يحافظ على الخصوصية مع السماح بالتحقق العام.

source: Immutable Issuer Identity
ar: هوية المُصدر غير قابلة للتغيير

# immutableIssuerIdentityContent
source: Each certificate is permanently linked to a blockchain-based identity representing the issuing institution, preventing forgery and ensuring trust.
ar: ترتبط كل شهادة بشكل دائم بهوية قائمة على البلوكشين تمثل المؤسسة المصدرة، مما يمنع التزوير ويضمن الثقة.

source: Delegated Certificate Issuance
ar: إصدار الشهادات المفوض

# delegatedCertificateIssuanceContent
source: Issuance can be done via a delegated profile that represents the institution rather than a personal cryptographic key, ensuring institutional continuity.
ar: يمكن إجراء الإصدار عبر ملف تعريف مفوض يمثل المؤسسة بدلاً من مفتاح تشفير شخصي، مما يضمن استمرارية المؤسسة.

source: Certificate Ownership
ar: ملكية الشهادة

# certificateOwnershipContent
source: Students may optionally receive on-chain ownership of their certificates, enhancing control and portability without requiring it for verification.
ar: يمكن للطلاب اختياريًا الحصول على ملكية شهاداتهم على البلوكشين، مما يعزز التحكم والتنقل دون الحاجة إلى التحقق.

source: Implementation Process
ar: عملية التنفيذ

# implementationProcessContent
source: 1. Configure a blockchain-based identity for the institution 2. Delegate issuance rights to a controlled profile 3. Use this app to generate and hash certificate content 4. Register the hash and metadata to the blockchain 5. Export certificate data for the recipient to store or share
ar: 1. تكوين هوية قائمة على البلوكشين للمؤسسة 2. تفويض حقوق الإصدار لملف تعريف متحكم به 3. استخدام هذا التطبيق لإنشاء وتجزئة محتوى الشهادة 4. تسجيل التجزئة والبيانات الوصفية على البلوكشين 5. تصدير بيانات الشهادة للمستلم لتخزينها أو مشاركتها

source: About KBUNET Network
ar: حول شبكة KBUNET

# decentralizedIdentities
source: Decentralized Identities (DIDs)
ar: الهويات اللامركزية (DIDs)

# decentralizedIdentitiesContent
source: KBUNET provides secure, blockchain-verified digital identities directly connected to your wallet, ensuring ownership and control over your digital self with on-chain profiles and a comprehensive reputation system.
ar: توفر KBUNET هويات رقمية آمنة ومثبتة على البلوكشين متصلة مباشرة بمحفظتك، مما يضمن الملكية والتحكم في هويتك الرقمية مع ملفات تعريف على البلوكشين ونظام شامل للسمعة.

source: Web3 Content Management
ar: إدارة محتوى الويب 3

# web3ContentManagementContent
source: Create and secure NFTs locally with the W3CM app, enabling offline content creation and direct blockchain registration without third parties. This app is part of the KBUNET ecosystem for certificate management.
ar: قم بإنشاء وتأمين NFTs محليًا باستخدام تطبيق W3CM، مما يتيح إنشاء المحتوى دون اتصال بالإنترنت والتسجيل المباشر على البلوكشين دون أطراف ثالثة. هذا التطبيق جزء من نظام KBUNET البيئي لإدارة الشهادات.

# reputationPoints
source: Reputation Points (RPs)
ar: نقاط السمعة (RPs)

# reputationPointsContent
source: Earn and build Reputation Points through network participation, creating a trustless system for evaluating user credibility and institution trustworthiness.
ar: اكسب وابنِ نقاط السمعة من خلال المشاركة في الشبكة، مما ينشئ نظامًا للتقييم بدون ثقة لمصداقية المستخدم وجدارة المؤسسة بالثقة.

source: Multiple Profile Types
ar: أنواع متعددة من ملفات التعريف

# multipleProfileTypesContent
source: Choose from various profile types including Identity, NFTs, and Domains, each with specific features suited to different use cases including certificate issuance.
ar: اختر من بين أنواع مختلفة من ملفات التعريف بما في ذلك الهوية وNFTs والنطاقات، كل منها بميزات محددة تناسب حالات الاستخدام المختلفة بما في ذلك إصدار الشهادات.
